Revit 2024 API
PrintManager.PaperSizes Property
Get all print sizes of current printer.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public PaperSizeSet PaperSizes { get; }
Visual Basic
Public ReadOnly Property PaperSizes As PaperSizeSet
	Get
Visual C++
public:
property PaperSizeSet^ PaperSizes {
	PaperSizeSet^ get ();
}
Remarks
These are the valid paper sizes for the current printer.
See Also
PrintManager Class
Autodesk.Revit.DB Namespace